

INSERT INTO City(City_name) VALUES
    ('Тамбов'),
    ('Санкт-Петербург'),
    ('Симферополь'),
    ('Сочи'),
    ('Томск'),
    ('Анапа'),
    ('Москва'),
    ('Саратов'),
    ('Щекино'),
    ('Новосибирск'),
    ('Краснодар');

INSERT INTO Transport(Licence_plate, Model, Carrying_capacity, Fuel_consumption, Tank_volume) VALUES
    ('Н236РН','Volvo FM D12D420 6x4', 25000, 20.5, 600),
    ('О992РА', 'ГАЗ ГАЗЕЛЬ 2704', 2500, 11, 70),
    ('С285РР','IVECO EuroCargo ML120 EL17', 8730, 9.75, 115),
    ('Х041МХ', 'ГАЗ 3307 3307', 2000, 20, 105),
    ('О294НТ', 'ГАЗ ГАЗЕЛЬ 2.3', 3000, 8.5, 70),
    ('О142ТО', 'ГАЗ ГАЗЕЛЬ 2704', 2500, 11.5, 70),
    ('Е559ЕМ', 'Mercedes-Benz Actros', 20000, 24.5, 950),
    ('К720ЕВ', 'MAN TGL 10.210 FRC', 10000, 19.7, 200),
    ('У193УХ', 'ГАЗ ГАЗЕЛЬ 2.4', 3000, 12.5, 70),
    ('Х740РЕ', 'ГАЗ ГАЗЕЛЬ Next 2.8 TD (149Hp) L2', 2000, 12.5, 80);

INSERT INTO Driver(Driver_name, Driver_phone, Category) VALUES
    ('Селезнёв Егор Парфеньевич', '235-67-19', 'CE'),
    ('Петров Андрей Ефимович', '654-70-27', 'C1E'),
    ('Федосеев Олег Леонидович', '861-81-97', 'CE'),
    ('Потапов Роман Тарасович', '996-24-82', 'CE'),
    ('Васильева Вера Константиновна', '985-07-69', 'CE'),
    ('Кириллов Константин Артёмович', '801-62-41', 'CE'),
    ('Ларин Игорь Вадимович', '598-27-32', 'C1E'),
    ('Николаева Анастасия Марковна', '926-28-98', 'C1E'),
    ('Макеев Владислав Родионович', '820-42-63', 'CE'),
    ('Смирнов Илья Романович', '971-61-78', 'CE');

INSERT INTO Trip(Transport_id, Departure_city, Arrival_city, Departure_date, Arrival_date, Travel_distance) VALUES
    (1, 7, 9, '2020-08-24', '2020-08-25', 228),
    (2, 1, 3, '2020-08-26', '2020-08-28', 1225),
    (5, 6, 7, '2020-08-26', '2020-08-28', 1501),
    (7, 2, 10, '2020-09-01', '2020-09-03', 3871),
    (4, 7, 3, '2020-09-02', '2020-09-04', 1099),
    (8, 6, 11, '2020-09-11', '2020-09-11', 194),
    (1, 5, 2, '2020-09-11', '2020-09-15', 4299),
    (7, 5, 2, '2020-09-11', '2020-09-15', 4299),
    (3, 4, 8, '2020-09-14', '2020-09-16', 1400),
    (10, 2, 11, '2020-09-20', '2020-09-22', 2067),
    (9, 5, 2, '2020-09-16', '2020-09-20', 4299),
    (9, 5, 2, '2020-09-24', '2020-09-28', 4299),
    (9, 5, 2, '2020-10-02', '2020-10-06', 4299),
    (9, 5, 2, '2020-10-10', '2020-10-14', 4299),
    (9, 5, 2, '2020-10-18', '2020-10-22', 4299),
    (9, 5, 2, '2020-11-01', '2020-11-05', 4299);

INSERT INTO Client(Client_name, Client_phone) VALUES
    ('Ященко Ксения Серафимовна', '903-63-60'),
    ('Арзамасцев Аристарх Евстафиевич', '627-29-12'),
    ('Абабков Яков Валерьянович', '303-79-55'),
    ('Коченкова Эмма Алексеевна', '200-99-85'),
    ('Рябоконь Елизар Данилевич', '995-26-57'),
    ('Сахаров Артемий Миронович', '855-77-77'),
    ('Фролова Анастасия Арсеньевна', '718-67-46'),
    ('Белякова Алиса Саввична', '479-46-53'),
    ('Александров Иван Никитич', '598-25-55'),
    ('Громов Егор Даниилович', '102-98-90');


INSERT INTO Orders(Client_id, Order_weight, Order_cost) VALUES
    (1, DEFAULT, 52600),
    (2, DEFAULT, 21000),
    (6, DEFAULT, 7000),
    (8, DEFAULT, 6500),
    (3, DEFAULT, 7000),
    (4, DEFAULT, 41500),
    (6, DEFAULT, 12000),
    (10, DEFAULT, 9200),
    (1, DEFAULT, 13000),
    (5, DEFAULT, 15000),
    (2, DEFAULT, 4000),
    (5, DEFAULT, 6700),
    (9, DEFAULT, 14800),
    (1, DEFAULT, 40000);

/*
INSERT INTO Cargo(Cargo_name, Cargo_weight, Is_flammable, Is_fragile, Order_id) VALUES
    ('Уличная Горелка', 17, true, false, 2),
    ('Уличная Горелка', 17, true, false, 2),
    ('Уличная Горелка', 17, true, false, 2),
    ('Уличная Горелка', 17, true, false, 2),
    ('Уличная Горелка', 17, true, false, 2),
    ('Уличная Горелка', 17, true, false, 2),
    ('Уличная Горелка', 17, true, false, 2),
    ('Ткань в рулонах ', 34, false, false, 5),
    ('Битый автомобиль', 1200, false, false, 6),
    ('Личные вещи', 105, false, false, 3), --10
    ('Кот', 5, false, true, 3),
    ('Детский велосипед', 15, false, false, 3),
    ('Гидроподъемник', 200, false, false, 7), --13
    ('Бревна сруба', 20000, false, false, 1),
    ('Бревна сруба', 15000, false, false, 1),
    ('Пиво бутылочное', 15, false, true, 4),
    ('Личные вещи', 68, false, false, 8),
    ('Матрас двуспальный', 25, false, false, 10),
    ('Личные вещи', 28, false, false, 9),
    ('Одежда', 1, false, false, 8), --20
    ('Личные вещи', 6, false, false, 11),
    ('Личные вещи', 13, false, true, 12),
    ('Личные вещи', 56, false, false, 13);
*/


INSERT INTO trip_order VALUES
    (7, 1),
    (8, 1),
    (2, 2),
    (2, 3),
    (2, 4),
    (9, 6),
    (3, 5),
    (4, 7),
    (5, 8),
    (6, 9),
    (9, 10),
    (10, 11),
    (10, 12),
    (10, 13),
    (11, 14),
    (12, 14),
    (13, 14),
    (14, 14),
    (15, 14),
    (16, 14);

INSERT INTO Trip_driver VALUES
    (1, 1),
    (2, 2),
    (3, 3),
    (4, 4),
    (4, 5),
    (5, 6),
    (6, 7),
    (7, 8),
    (7, 9),
    (8, 1),
    (8, 2),
    (9, 5),
    (10, 3),
    (11, 8),
    (11, 9),
    (12, 8),
    (12, 9),
    (13, 8),
    (13, 9),
    (14, 8),
    (14, 9),
    (15, 8),
    (15, 9),
    (16, 8),
    (16, 9);